In [2]:
import pandas as pd

In [3]:
train = pd.read_csv('./Dacon/funda_train.csv')

In [4]:
train.head(6)

,store_id,card_id,card_company,transacted_date,transacted_time,installment_term,region,type_of_business,amount
0,0,0,b,2016-06-01,13:13,0,NaN,기타 미용업,1857.142857
1,0,1,h,2016-06-01,18:12,0,NaN,기타 미용업,857.142857
2,0,2,c,2016-06-01,18:52,0,NaN,기타 미용업,2000.000000
3,0,3,a,2016-06-01,20:22,0,NaN,기타 미용업,7857.142857
4,0,4,c,2016-06-02,11:06,0,NaN,기타 미용업,2000.000000
5,0,5,c,2016-06-02,13:09,0,NaN,기타 미용업,2000.000000

In [5]:
train.tail(10)

,store_id,card_id,card_company,transacted_date,transacted_time,installment_term,region,type_of_business,amount
6556603,2136,4663852,a,2019-02-28,22:35,0,제주 제주시,기타 주점업,4571.428571
6556604,2136,4663853,e,2019-02-28,22:43,0,제주 제주시,기타 주점업,3571.428571
6556605,2136,4663666,f,2019-02-28,22:45,0,제주 제주시,기타 주점업,7428.571429
6556606,2136,4663854,f,2019-02-28,23:03,0,제주 제주시,기타 주점업,3928.571429
6556607,2136,4663855,d,2019-02-28,23:20,0,제주 제주시,기타 주점업,4500.000000
6556608,2136,4663855,d,2019-02-28,23:20,0,제주 제주시,기타 주점업,-4500.000000
6556609,2136,4663855,d,2019-02-28,23:24,0,제주 제주시,기타 주점업,4142.857143
6556610,2136,4663489,a,2019-02-28,23:24,0,제주 제주시,기타 주점업,4500.000000
6556611,2136,4663856,d,2019-02-28,23:27,0,제주 제주시,기타 주점업,571.428571
6556612,2136,4658616,c,2019-02-28,23:54,0,제주 제주시,기타 주점업,5857.142857

In [6]:
train.describe()

           store_id       card_id  installment_term        amount
count  6.556613e+06  6.556613e+06      6.556613e+06  6.556613e+06
mean   1.084930e+03  2.268127e+06      1.382017e-01  1.043511e+04
std    6.152183e+02  1.351058e+06      1.188152e+00  3.104031e+04
min    0.000000e+00  0.000000e+00      0.000000e+00 -2.771429e+06
25%    5.860000e+02  1.088828e+06      0.000000e+00  2.142857e+03
50%    1.074000e+03  2.239304e+06      0.000000e+00  4.285714e+03
75%    1.615000e+03  3.438488e+06      0.000000e+00  8.571429e+03
max    2.136000e+03  4.663856e+06      9.300000e+01  5.571429e+06

In [7]:
train.dtypes

store_id              int64
card_id               int64
card_company         object
transacted_date      object
transacted_time      object
installment_term      int64
region               object
type_of_business     object
amount              float64
dtype: object

In [8]:
train.columns

Index(['store_id', 'card_id', 'card_company', 'transacted_date',
       'transacted_time', 'installment_term', 'region', 'type_of_business',
       'amount'],
      dtype='object')

In [9]:
len(train)

6556613

In [100]:
set_amount = train[(train['transacted_date']>='2018-03-01') & (train['transacted_date'] <= '2018-05-31')]

In [101]:
set_amount.head(5)

,store_id,card_id,card_company,transacted_date,transacted_time,installment_term,region,type_of_business,amount
2938,0,855,a,2018-03-01,10:21,0,NaN,기타 미용업,1857.142857
2939,0,1278,g,2018-03-01,14:47,0,NaN,기타 미용업,7142.857143
2940,0,177,h,2018-03-01,16:50,0,NaN,기타 미용업,2000.000000
2941,0,857,a,2018-03-01,16:51,0,NaN,기타 미용업,10000.000000
2942,0,1279,g,2018-03-01,18:29,0,NaN,기타 미용업,7714.285714

In [13]:
set_amount.groupby('store_id')['amount'].sum().to_csv('./Dacon/first_test.csv')

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [14]:
train['store_id']

0             0
1             0
2             0
3             0
4             0
           ...
6556608    2136
6556609    2136
6556610    2136
6556611    2136
6556612    2136
Name: store_id, Length: 6556613, dtype: int64

In [15]:
train['store_id'].nunique()

1967

In [16]:
set_amount['store_id'].nunique()

1955

In [18]:
train[pd.isna(train['store_id'])]

Empty DataFrame
Columns: [store_id, card_id, card_company, transacted_date, transacted_time, installment_term, region, type_of_business, amount]
Index: []

### 잃어버린 12개를 찾아서 1

In [26]:
m_stores = set(train['store_id'].unique())

In [27]:
b_stores = set(set_amount['store_id'].unique())

In [38]:
missing = list(m_stores - b_stores)

### 잃어버린 12개를 찾아서 2

In [64]:
train[~(train['store_id'].isin(set_amount['store_id']))].nunique()

store_id               12
card_id             15858
card_company            8
transacted_date       872
transacted_time      1090
installment_term       12
region                  7
type_of_business        4
amount               1799
dtype: int64

In [78]:
missing_datas = train[~(train['store_id'].isin(set_amount['store_id']))]

In [79]:
missing_datas['store_id'].nunique()

12

### 왜 빠졌을까?

In [96]:
missing_datas[(missing_datas['transacted_date'] < '2018-03-01') | (missing_datas['transacted_date'] > '2018-05-31')].count()

store_id            22721
card_id             22721
card_company        22721
transacted_date     22721
transacted_time     22721
installment_term    22721
region              17717
type_of_business     4141
amount              22721
dtype: int64

In [87]:
]

SyntaxError: invalid syntax (<ipython-input-87-de603c91038f>, line 1)

In [30]:
len(list(m_stores - b_stores))

12

In [37]:
missing_pd.DataFrame(missing)

       0
0   2081
1    706
2    515
3   1379
4    999
5   2119
6    588
7   2094
8    271
9   1435
10   279
11   795

## 추가문제 해결해보기

### Q1. 업종전환을 한 가게가 있나요?

In [44]:
train.head(5)

,store_id,card_id,card_company,transacted_date,transacted_time,installment_term,region,type_of_business,amount
0,0,0,b,2016-06-01,13:13,0,NaN,기타 미용업,1857.142857
1,0,1,h,2016-06-01,18:12,0,NaN,기타 미용업,857.142857
2,0,2,c,2016-06-01,18:52,0,NaN,기타 미용업,2000.000000
3,0,3,a,2016-06-01,20:22,0,NaN,기타 미용업,7857.142857
4,0,4,c,2016-06-02,11:06,0,NaN,기타 미용업,2000.000000

In [126]:
tmp = train.groupby('store_id')['type_of_business'].nunique().reset_index(name='counts')

In [129]:
tmp

      store_id  counts
0            0       1
1            1       0
2            2       0
3            4       0
4            5       1
...        ...     ...
1962      2132       0
1963      2133       0
1964      2134       0
1965      2135       0
1966      2136       1

[1967 rows x 2 columns]

### Q2. 상점의 지역 별 분포는 어떻게 되나요?

### Q3. 상점의 업종 별 분포는 어떻게 되나요?

### Q4. 요일 별 매출은 어떻게 변하나요?

### Q5. 공휴일이 매출에 영향을 미치나요?

### Q6. 요일 별 Seasonality 말고, 또 다른 기간 별 패턴을 발견했나요?

### Q7. 새로운 질문을 던져보세요.